#include"workerManager.h"

WorkerManager::WorkerManager()
{

}

void WorkerManager::show_Menu()
{
	cout << "********************************************" << endl;
	cout << "*********  欢迎使用职工管理系统！ **********" << endl;
	cout << "*************  0.退出管理程序  *************" << endl;
	cout << "*************  1.增加部门信息  *************" << endl;
	cout << "*************  2.显示部门信息  *************" << endl;
	cout << "*************  3.删除部门信息  *************" << endl;
	cout << "*************  4.修改部门信息  *************" << endl;
	cout << "*************  5.增加职工信息  *************" << endl;
	cout << "*************  6.显示职工信息  *************" << endl;
	cout << "*************  7.删除离职职工  *************" << endl;
	cout << "*************  8.修改职工信息  *************" << endl;
	cout << "*************  9.查找职工信息  *************" << endl;
	cout << "*************  10.按照编号排序  *************" << endl;
	cout << "*************  11.清空所有文档  *************" << endl;
	cout << "********************************************" << endl;
	cout << endl;
}
WorkerManager::~WorkerManager()
{

}